"""
 聊天室
 思路分析

 1. 功能和需求分析
    客户端发送给服务端 服务端转发给其他客户端
 2. 技术分析
    服务端 客户端
    网络 upd
    用户信息存储：{name:address} [(name,address),()]
                链表 data --> (name,address)
    客户端收发消息：多进程分别处理收发消息
 3. 结构设计
    采用 函数 封装
 注意事项：注释的添加 15-20%的注释
         功能的测试 写一个功能测一个
 4. 分析功能模块,指定编写流程
    * 搭建网络连接
    * 进入聊天室
        客户端:  1.输入姓名
                2.将姓名发送给服务端
                3.收到服务端反馈
                4.进入聊天室或者重新输入姓名

        服务端:  1.收到请求
                2.判断姓名是否存在
                3.反馈信息给客户端
                4.不允许进入结束,允许进入将用户插入字典
                5.通知其他用户
    * 聊天
        客户端:  1.创建新的进程
                2.父进程收消息
                3.子进程发消息

        服务端:  1.接收请求
                2.将消息发送给其他人


    * 退出聊天室
        客户端:  1.输入退出指令
                2.将请求发给服务端
                3.结束进程
                4.接收EXIT表示退出

        服务端:  1.接收请求
                2.通知其他人某某某退出了聊天室
                3.发送EXIT给退出的客户端
                4.把其名字从字典中删除

    * 管理员消息
 5. 协议的设置
    存储用户结构:  {name:address}
    进入聊天室:   如果允许进入则服务端给客户端发送成功加入法拉利车队
                不允许进入则服务端给客户端发送：不允许进入的原因
    请求类型:
        * 进入聊天室:   L name
        * 发送聊天信息: C name content
        * 退出聊天:    Q name

    客户端退出: quit
"""





